---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElementFailures.FailedToRemoveElement
source: html/84b3bac3-82c9-2a9c-a680-588628aaa722.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElementFailures.FailedToRemoveElement Property

Element cannot be removed from the solution. The solution is required to have at least two elements to be valid.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToRemoveElement { get; }
```